app/controllers/articles_controller.rb

  def index
    @items = Article.order(:id).all
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."id" ASC