app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."id" ASC
---
  def index
    @items = Book.order(:id).all

SELECT  "books"."name" FROM "books" ORDER BY length(name) DESC LIMIT $1  [["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE (length(name) in (2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47)) ORDER BY "books"."id" ASC
---
  def prime
    max_length = Book.order('length(name) DESC').limit(1).pluck(:name).first.size
    prime_numbers = Prime.take_while { |p| p < max_length }

    @items = Book.where("length(name) in (#{prime_numbers.join(', ')})").order(:id).all