app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists" ORDER BY "lists"."id" ASC
---
  def books
    @items = List.order(:id).all