app/controllers/search_controller.rb

SELECT "articles".* FROM "articles"
SELECT "books".* FROM "books" WHERE ("books"."publisher" ILIKE '%ssss%')
---
  def find
    search_params = {}
    params.permit(:publisher_cont, :authors_cont, :genres_cont, :name_cont).each do |key, value|
      search_params[key.to_sym] = value if value.present?
    end
    @result = []

    unless search_params.key?(:publisher_cont)
      @result += Article.ransack(search_params.except(:publisher_cont)).result.to_a
    end
    @result += Book.ransack(search_params).result.to_a